## Staging: system_status_static_site
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 6 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                         NAME                                         |
|--------|--------------------------------------------------------------------------------------|
| add    | `module.system_status_static_site.aws_cloudfront_distribution.simple_static_website` |
|        | `module.system_status_static_site.aws_route53_record.cloudfront_alias`               |
|        | `module.system_status_static_site.aws_s3_bucket.this`                                |
|        | `module.system_status_static_site.aws_s3_bucket_policy.oai_policy`                   |
|        | `module.system_status_static_site.aws_s3_bucket_public_access_block.this`            |
|        | `module.system_status_static_site.aws_s3_bucket_website_configuration.this`          |
| delete | `aws_acm_certificate.system_status_static_site_root_certificate`                     |
|        | `module.system_status_static_site[0].aws_s3_bucket.this`                             |
|        | `module.system_status_static_site[0].random_string.suffix`                           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_acm_certificate.system_status_static_site_root_certificate will be destroyed
  # (because aws_acm_certificate.system_status_static_site_root_certificate is not in configuration)
  - resource "aws_acm_certificate" "system_status_static_site_root_certificate" {
      - arn                       = "arn:aws:acm:us-east-1:239043911459:certificate/c3e1b153-4a3e-4aa9-a19d-8c67f331ee71" -> null
      - domain_name               = "status.staging.notification.cdssandbox.xyz" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "status.staging.notification.cdssandbox.xyz"
              - resource_record_name  = "_440d029c47fc1dfe910ea2610b495f24.status.staging.notification.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_2b263703fa6b736f742a52128f2261b7.mhbtsbpdnt.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:239043911459:certificate/c3e1b153-4a3e-4aa9-a19d-8c67f331ee71" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2025-02-06T23:59:59Z" -> null
      - not_before                = "2024-01-09T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - renewal_eligibility       = "INELIGIBLE" -> null
      - renewal_summary           = [] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "status.staging.notification.cdssandbox.xyz",
        ] -> null
      - tags                      = {
          - "CostCenter" = "notification-canada-ca-staging"
        } -> null
      - tags_all                  = {
          - "CostCenter" = "notification-canada-ca-staging"
        } -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.system_status_static_site.data.aws_iam_policy_document.s3_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E1C62IWA4QEU4W",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.system_status_static_site.aws_cloudfront_distribution.simple_static_website will be created
  + resource "aws_cloudfront_distribution" "simple_static_website" {
      + aliases                         = [
          + "status.staging.notification.cdssandbox.xyz",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "simple_static_website"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "simple_static_website"

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E1C62IWA4QEU4W"
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:239043911459:certificate/87e4373e-aef7-44ea-9f25-8ce7e033a207"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.system_status_static_site.aws_route53_record.cloudfront_alias will be created
  + resource "aws_route53_record" "cloudfront_alias" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "status.staging.notification.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.system_status_static_site.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "notification-canada-ca-staging-system-status"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.system_status_static_site.aws_s3_bucket_policy.oai_policy will be created
  + resource "aws_s3_bucket_policy" "oai_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.system_status_static_site.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.system_status_static_site.aws_s3_bucket_website_configuration.this will be created
  + resource "aws_s3_bucket_website_configuration" "this" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

  # module.system_status_static_site[0].aws_s3_bucket.this will be destroyed
  # (because module.system_status_static_site[0] is not in configuration)
  - resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::notification-canada-ca-staging-system-status" -> null
      - bucket                      = "notification-canada-ca-staging-system-status" -> null
      - bucket_domain_name          = "notification-canada-ca-staging-system-status.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "notification-canada-ca-staging-system-status.s3.ca-central-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1QDHH18159H29" -> null
      - id                          = "notification-canada-ca-staging-system-status" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ca-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - website_domain              = "s3-website.ca-central-1.amazonaws.com" -> null
      - website_endpoint            = "notification-canada-ca-staging-system-status.s3-website.ca-central-1.amazonaws.com" -> null

      - grant {
          - id          = "69e55cefe4e71d4930761796ca1b0184cad872eb794dd25fbfc366b4501a75f9" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.system_status_static_site[0].random_string.suffix will be destroyed
  # (because module.system_status_static_site[0] is not in configuration)
  - resource "random_string" "suffix" {
      - id          = "9inniwxf" -> null
      - length      = 8 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "9inniwxf" -> null
      - special     = false -> null
      - upper       = false -> null
    }

Plan: 6 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ system_status_static_site_bucket_id     = "notification-canada-ca-staging-system-status" -> (known after apply)
  ~ system_status_static_site_bucket_name   = "arn:aws:s3:::notification-canada-ca-staging-system-status" -> (known after apply)
  ~ system_status_static_site_bucket_region = "ca-central-1" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

